{
  "menu": {
    "nav": "navegação",
    "about": "sobre",
    "projects": "projetos",
    "links": "links",
    "theme": {
      "dark": "dark",
      "light": "light"
    },
    "lang": {
      "en": "en",
      "pt-br": "pt-br"
    },
    "talk": "me chama"
  },
  "landing": {
    "dev": {
      "front": "Desenvolvedor Front-End",
      "back": "Desenvolvedor Back-End",
      "full": "Desenvolvedor Full-Stack"
    },
    "text": "Olá, Eu sou o Hugo um <span>Cientista de Possibilidades</span> atuando na intercessão de desenvolvimento e design.<br /><br />Experimentando e aprendendo com o novo e o tradicional para <span>criar experiências originais</span> e <span>resolver os problemas</span> do nosso tempo.",
    "scroll": "role para saber mais",
    "update": "atualizado em: Nov / 22"
  },
  "about": {
    "title": "Sobre",
    "part1": "Desde que ingressei no Ouribank em dezembro de 2022, tenho desempenhado um papel fundamental em uma equipe que trabalha no desenvolvimento de um produto em crescimento, ao mesmo tempo que contribuo ocasionalmente para outros projetos internos e promovo a colaboração eficaz em equipes multidisciplinares.",
    "part2": "Estou aprimorando ativamente minha experiência em metodologias ágeis e obtendo insights valiosos sobre funções de gerenciamento de projetos, como Líder Técnico e Proprietário de Produto.",
    "part3": "Além de minhas habilidades técnicas, sou reconhecido por minhas habilidades interpessoais excepcionais, incluindo comunicação clara, trabalho colaborativo em equipe, adaptabilidade a novos ambientes e manutenção de um equilíbrio saudável entre vida pessoal e profissional. Sou profundamente apaixonado pelo aprendizado contínuo e me mantenho atualizado com as últimas tendências e melhores práticas do setor.",
    "techs": {
      "title": "Teconologias & Softwares",
      "most": "Maior Experiênica",
      "some": "Alguma Experiência",
      "softwares": "Outros Softwares"
    }
  },
  "projects": {
    "title": "Projetos",
    "menu": {
      "all": "Todos",
      "team": "Equipe",
      "study": "Estudo",
      "personal": "Pessoal"
    },
    "list": {
      "color": {
        "title": "Color me... uncertain",
        "type": "Projeto Pessoal",
        "description": "Um jogo de cobinação de cores, desenvolvido com HTML5, JavaScript puro e CSS3, para praticar o que eu tinha aprendido até aquele momento sobre essas tecnologias. E embora tenha iniciado como um jogo, com o desenvolvimento do projeto eu passei a enxergar o projeto como “obra de arte generativa”, que tem um sistema de pontos e rounds."
      },
      "bwlgari": {
        "title": "Bwlgari",
        "type": "Projeto de Estudo",
        "description": "O projeto que encerrou o primeiro módulo do curso na Kenzie Academy Brasil, utilizando HTML5, JavaScript puro, e CSS3, Eu criei um e-ecomerce de página única com dois tipos de filtros, carrinho, e lista de desejos, com produtos da marca BVLGARI."
      },
      "genius": {
        "title": "GENIUS",
        "type": "Projeto de Estudo",
        "description": " Um ótimo projeto para afiar nossa lógica, nesse o objetivo era reproduzir o jogo Genius, mas como gosto de experimentar as possibilidades eu fui um pouco além e criei um sistema de pntuação e mais dois níveis de dificuldade em que o jogador tem mais pontos por round mas a sequêcia é exibida em menos tempo."
      },
      "oregon": {
        "title": "Oregon Trail",
        "type": "Projeto de Estudo",
        "description": "Este projeto foi o primeiro no qual eu apliquei o paradigma de Programação Orientada ao Objeto com JavaSccript, e é mais um que fui além do enunciado, Eu decidi representar visualmente as modificações nas classes, e assim o fiz utilizando HTML5 e manipulação de DOM com JavaScript e CSS3."
      },
      "products": {
        "title": "Lista de Produtos",
        "type": "Projeto de Estudo",
        "description": "Outro projeto de e-commerce, e esse teve três iterações, a primeira em que eu apenas listava os itens, a segunda em que eu adicionei o carrinho, e a terceira em que converti todo o projeto para o paradigma de programação orientada ao objeto. Como costumo fazer, eu fui além do que pedia o enunciado melhorando o CSS disponibilizado."
      },
      "music": {
        "title": "Kenzie Music",
        "type": "Projeto de Estudo",
        "description": "Esse projeto foi bastante divertido, foi o meu primeiro contato com APIs e assincronia, então naturalmente eu fiquei empolgado e ao invés de criar apenas uma barra para pesquisar os nomes das músicas, eu desenvolvi uma playlist simpes em que a pessoa pode adicionar, remover (para outra lista), e deletar a música pesquisada."
      },
      "blog": {
        "title": "Blog Comunitário",
        "type": "Projeto de Estudo",
        "description": "Este projeto foi ótimo para aprender mais e praticar validação de formulário e uso de API. Foi desenvolido com JavaScript puro, HTML5 e CSS3. O objetivo era criar um blog comunitário em que apenas usuários cadastrados podem postar, e apenas o dono pode editar ou apagar um post."
      },
      "reproduction": {
        "title": "Reproduzindo Layout",
        "type": "Projeto de Estudo",
        "description": "Nesse projeto o desafio foi reproduzir um layout conhecido (Netflix) utilizando apenas JavaScript puro, HTML5 e CSS3. Eu gostei muito de fazer esse pois eu sempre vi outras pessoas fazendo mas nunca tinha feito, e quando terminei ficou claro por que essa prática é popular, aprendi bastante!"
      },
      "food": {
        "title": "Kenzie Food",
        "type": "Projeto em Equipe",
        "description": "Esse foi um projeto em equipe, no qual eu tive a oportunidade de atuar como Tech Leader seguindo metodologia ágil. Nesse nossa equipe tinha o objetivo de criar um e-commerce aplicando o todo conteúdo do móedulo: API, OOP, LocalStorage, Mobile First. Utilizando JavaScript puro, HTML5 e CSS3."
      },
      "nu": {
        "title": "Nu Kenzie",
        "type": "Projeto de Estudo",
        "description": "Um projeto interessante, foi um dos primeiros utilizando React e os estados (states), e tem duas iterações, uma sem e outra com a lib Styled Components. Nesse projeto a aplicação simula uma carteira digital em que o usuário pode registrar lucros e gastos."
      },
      "burguer": {
        "title": "Kenzie Burguer",
        "type": "Projeto de Estudo",
        "description": "Nesse projeto eu pratiquei o uso de APIs com React, aprendendo mais sobre os rooks do react e a biblioteca Axios. Eu também experimentei criar temas claro e escuro com a Styled Components. Nele criamos um e-commerce de fast-food com produtos de uma API."
      },
      "form": {
        "title": "Form Practice",
        "type": "Projeto de Estudo",
        "description": "Eu fui para uma rota mais experimental nesse, o objetivo do projeto era a prática de formulários e validações em React utilizando libs. externas, mas como faço frequentemente, fui além do que pedia o enunciado, e brinquei um pouco com a lib. Framer Motion para criar uma “experiência realxante” para os usuários registrados."
      },
      "hub": {
        "title": "Kenzie Hub",
        "type": "Projeto de Estudo",
        "description": "Nesse projeto o objetivo era integrar as praticas que tivemos em outros projetos, (fomulários e API) em um único projeto de React. A aplicação então simula uma plataforma em que um usuário pode consultar as tecnologias e o nível de cada uma, que outros devs conhecem, e também se cadastrar para registrar suas técnologias."
      },
      "redux": {
        "title": "Kenzieshop - Redux",
        "type": "Projeto de Estudo",
        "description": "Nesse projeto eu tinha carta-branca para escolher um tema para o e-commerce, então decidi revisitar o projeto que fiz na conclusão do primeiro módulo do curso, e refatorá-lo com React, Redux e Thunk como middleware, e Styled Components."
      },
      "context": {
        "title": "Kenzieshop - Context",
        "type": "Projeto de Estudo",
        "description": "Esse projeto é uma segudna iteração the um outro projeto em que utilizei Redux com Thunk para criar um e-commerce, mas eu acabei não só refatorando o gerênciamento de estado para a Context API do React mas também o tema da loja."
      },
      "relativi": {
        "title": "Relativi",
        "type": "Projeto em Equipe",
        "description": "Um outro projeto em equipe, e nesse tive a oportunidade de atuar como Product Owner seguindo a metodologia ágil. Nossa equipe decidiu criar uma aplicação voltada para saúde e bem-estar, que beneficia não apenas usuários mas também profissionais do setor, utilizando React, Redux, Styled Components, Axios, e JSON-Server para simular o banco de dados hospedado com Heroku."
      },
      "relativi-back": {
        "title": "Relativi Backend",
        "type": "Projeto em Equipe",
        "description": "Mais um projeto em equipe, e nesse tive a oportunidade de atuar como Tech Leader seguindo a metodologia ágil. Nossa equipe decidiu criar uma REST API para uma aplicação de saúde e bem-estar, utilizando Node, Express, TypeORM, PostgreSQL, e Docker."
      },
      "gdc-api": {
        "title": "GDC API",
        "type": "Projeto em Equipe",
        "description": "Um projeto em equipe, e nesse tive a oportunidade de atuar como Product Owner seguindo a metodologia ágil. Nossa equipe decidiu criar uma REST API para o gerenciamento de candidaturas, utilizando Python, Django Rest Framework, e PostgreSQL."
      },
      "pokedex-vue": {
        "title": "Vue.js Pokédex",
        "type": "Projeto de Estudo",
        "description": "Um projeto que utiliza a PokeAPI para criar uma ferramenta que busca Pokémons e suas evoluções tranzendo informações e atributos de cada pokémon encontrado. Utilizei Vue.js pela primeira vez com TypeScript e Scss."
      },
      "ng-cash": {
        "title": "NG Cash",
        "type": "Projeto de Estudo",
        "description": "A ideia era criar uma aplicação em usuários pudessem se cadastrar com um username e senha, e com uma autenticação realizar “cash-outs“: transferências para outros usuários a partir de seus usernames. Bem como visualizar e filtrar as transações das quais participou. Nesse projeto eu utilizei Jest, Supertest e Sqlite3 para os testes unitários e de integração, PostgreSQL para o banco de dados, Node, Express, TypeScript e TypeORM para o backend, React, Context API, Styled-Components e TypeScript para o frontend e o Docker para orquestrar tudo isso."
      },
      "single-spa-ecommerce": {
        "title": "Single SPA - Ecommerce",
        "type": "Projeto de Estudo",
        "description": "A motivação por trás deste projeto surgiu de uma situação no trabalho: nossa equipe em breve ira iniciar uma transição para uma arquitetura micro-frontend para nossos produtos. Querendo estar à frente da curva e aprofundar meu conhecimento, iniciei esse projeto como uma prova de conceito (ou POC em inglês). Foi uma oportunidade não só para compreender melhor o conceito, mas também para explorar uma ferramenta de gestão do estado diferente das que utilizo."
      }
    },
    "buttons": {
      "repo": "Repositório",
      "app": "Aplicação",
      "video": "Vídeo"
    }
  },
  "links": {
    "title1": "Links & Download",
    "title2": "Vamos conversar",
    "linkedin": {
      "title": "LinkedIn",
      "text": "Onde posto a maioria dos projetos e experimentos, então fique a vontade para acompanhar essa jornada, descbrir mais proejtos, o apenas bater um papo."
    },
    "github": {
      "title": "GitHub",
      "text": "Encontre os repositórios dos projetos listados aqui, projetos em progresso e em hiato."
    },
    "resume": {
      "title": "Currículo",
      "text": "Baixe a versão mais recente do meu currículo."
    },
    "whats": {
      "title": "WhatsApp",
      "text": "Clique para enviar uma mensagem, fazer uma chamada de video ou voz por WhatsApp."
    },
    "telegram": {
      "title": "Telegram",
      "text": "Clique para enviar uma mensagem, me chamar por video ou voz, ou pesquise <span>hblerdev</span> no Telegram."
    },
    "email": {
      "title": "Email",
      "text": "Tem um feedback, ideia, sugestão ou proposta? Me manda um email."
    },

    "thanks": "Agradeço sua visita!"
  }
}
